In [8]:
import pandas as pd

In [23]:
df=pd.read_csv('stats.csv')

In [26]:
df

        Name  Salary Country
0        Dan   40000     USA
1  Elizabeth   32000  Brazil
2        Jon   45000   Italy
3      Maria   54000     USA
4       Mark   72000     USA
5       Bill   62000  Brazil
6       Jess   92000   Italy
7      Julia   55000     USA
8       Jeff   35000   Italy
9        Ben   48000  Brazil

# Measure of Central Tendancy

In [29]:

mean1=df['Salary'].mean()
mean1

53500.0

In [30]:

sum1=df['Salary'].sum()
sum1

535000

In [31]:

max1=df['Salary'].max()
max1

92000

In [32]:

min1=df['Salary'].min()
min1

32000

In [33]:

count1=df['Salary'].count()
count1

10

In [34]:

median=df['Salary'].median()
median

51000.0

In [35]:

mode1=df['Salary'].mode()
mode1

0    32000
1    35000
2    40000
3    45000
4    48000
5    54000
6    55000
7    62000
8    72000
9    92000
dtype: int64

In [36]:
countrywise_sum=df.groupby(['Country'])['Salary'].sum()
countrywise_sum

Country
Brazil    142000
Italy     172000
USA       221000
Name: Salary, dtype: int64

In [37]:
countrywise_count=df.groupby(['Country']).count()
countrywise_count

         Name  Salary
Country
Brazil      3       3
Italy       3       3
USA         4       4

# Measure of variability

In [38]:

var1=df['Salary'].var()
var1

332055555.5555556

In [39]:

std1=df['Salary'].std()
std1

18222.391598128816

# Measure of Symmetry

In [40]:
skew1=df.skew(axis=0, skipna=True)
skew1

C:\Users\mazir\AppData\Local\Temp/ipykernel_11572/605898899.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  skew1=df.skew(axis=0, skipna=True)

Salary    1.021551
dtype: float64

In [41]:

df.describe()

             Salary
count     10.000000
mean   53500.000000
std    18222.391598
min    32000.000000
25%    41250.000000
50%    51000.000000
75%    60250.000000
max    92000.000000